AguHDz/PicPas-Librerias_y_Programas/Compativa Compiladores II/Digital_Clock_Test_PIC16F84A_XC8_registered.c
    for(LoopCounter=0; LoopCounter<8; LoopCounter++)
    {
        SDA = (dato & 0x80) == 0x80;    // SDA = bit de más peso del valor dato.
        SCL_HIGH;
        dato<<=1;
        SCL_LOW;
    }

    SDA_INPUT;
    SCL_HIGH;
    ACKbit = SDA;
    SCL_LOW;
    SDA_OUTPUT;
    return ACKbit;
}
uint8_t I2C_readByte(bool ACKByte)   // Receive data from I2C
{
    uint8_t LoopCounter;
    uint8_t dato=0; 

    SDA_INPUT;
    for(LoopCounter=0; LoopCounter<8; LoopCounter++)
    {
        SCL_HIGH;
        dato<<=1;
        if(SDA) dato|=1;
        SCL_LOW;
    }

    SDA_OUTPUT;
    SDA = !ACKByte;
    SCL_HIGH;
    SCL_LOW;
    return dato;
}

/****************************************************************************
  - Función: BCDToDecimal
  - Descripción: Transforma un número en formato BCD a Decimal.
  - Entrada:
      > bcdByte: Número en formato BCD
  - Salida: Número en formato Decimal.
*****************************************************************************/
uint8_t BCDToDecimal(uint8_t bcdByte)
{
    uint8_t decimal = 0;

    while(bcdByte > 0x09)
    {
        bcdByte -= 0x10;
        decimal += 10;
    }
    decimal += bcdByte;     // Suma el resto <= $09.
    return decimal;         // Devuelve valor en formato decimal.
}

/****************************************************************************
  - Función: decimalToBCD
  - Descripción: Transforma un número en formato Decimal a BCD.
  - Entrada:
      > decimalByte: Número en formato Decimal
  - Salida: Número en formato BCD.
*****************************************************************************/
uint8_t decimalToBCD (uint8_t decimalByte)
{
    uint8_t BCDByte = 0;

    while(decimalByte > 9)
    {
        BCDByte     += 0x10;
        decimalByte -= 10;
    }
    BCDByte += decimalByte;    // Suma el resto <= 9.
    return BCDByte;            // Devuelve valor en formato BCD.
}

/****************************************************************************
  - Función: DS1307_timeRead
  - Descripción: Lee fecha y hora del DS1307 a través del bus I2C.
  - Entrada: Ninguna.
  - Salida: Ninguna.
*****************************************************************************/
void DS1307_timeRead(void)
{
    I2C_start();          // Inicia comunicación I2C.
    I2C_writeByte(0xD0);  // Dirección I2C del DS1307.
    I2C_writeByte(0x00);  // Primera dirección a leer/escribir.
    I2C_start();          // Reinicia comunicación I2C.
    I2C_writeByte(0xD1);  // DS1307 en Modo Escritura.
    DS1307_Segundo   = BCDToDecimal(I2C_readByte(true)); // ASK = 1
    DS1307_Minuto    = BCDToDecimal(I2C_readByte(true));
    DS1307_Hora      = BCDToDecimal(I2C_readByte(true));
    DS1307_DiaSemana = I2C_readByte(true);  // Valor 1...7 (igual en decimal que en BCD)
    DS1307_Dia       = BCDToDecimal(I2C_readByte(true));
    DS1307_Mes       = BCDToDecimal(I2C_readByte(true));
    DS1307_Ano       = BCDToDecimal(I2C_readByte(false)); // ASK = 0
            // El último ASK antes del Stop debe ser sea cero (/ASK).
    I2C_stop();
}

/****************************************************************************
  - Función: DS1307_timeWrite
  - Descripción: Escribe fecha y hora en el DS1307 a través del bus I2C.
  - Entrada: Ninguna.
  - Salida: Ninguna.
*****************************************************************************/
void DS1307_timeWrite(void)
{
    I2C_start();          // Inicia comunicación I2C
    I2C_writeByte(0xD0);  // Dirección I2C del DS1307.
    I2C_writeByte(0x00);  // Primera dirección a leer/escribir.
    I2C_writeByte(0);     // Siempre que se ajusta la fecha y hora los Segundos=0.
    I2C_writeByte(decimalToBCD(DS1307_Minuto));
    I2C_writeByte(decimalToBCD(DS1307_Hora));
    I2C_writeByte(DS1307_DiaSemana);  // Valor 1...7 (igual en decimal que en BCD)
    I2C_writeByte(decimalToBCD(DS1307_Dia));
    I2C_writeByte(decimalToBCD(DS1307_Mes));
    I2C_writeByte(decimalToBCD(DS1307_Ano));
    I2C_stop();
}

/****************************************************************************
  - Función: LCDPrintDiaSemana
  - Descripción: Muesta en display LCD el día de la semana actual en
    formato texto.
  - Variables Entrada:
      > dia: Día de la semana en formato numérico (0:Domingo... 6:Sábado)
  - Variables Salida: Ninguna.
*****************************************************************************/
void LCDPrintDiaSemana(void)
{
    switch (DS1307_DiaSemana)
    {
    case 1:
        LCD_putChar('D');
        LCD_putChar('O');
        LCD_putChar('M');
        break;
    case 2:
        LCD_putChar('L');
        LCD_putChar('U');
        LCD_putChar('N');
        break;
    case 3:
        LCD_putChar('M');
        LCD_putChar('A');
        LCD_putChar('R');
        break;
    case 4:
        LCD_putChar('M');
        LCD_putChar('I');
        LCD_putChar('E');
        break;
    case 5:
        LCD_putChar('J');
        LCD_putChar('U');
        LCD_putChar('E');
        break;
    case 6:
        LCD_putChar('V');
        LCD_putChar('I');
        LCD_putChar('E');
        break;
    case 7:
        LCD_putChar('S');
        LCD_putChar('A');
        LCD_putChar('B');
        break;
    }
}

/****************************************************************************
  - Función: bisiesto
  - Descripción: Comprueba si el año actual es bisiesto [margen de 2000 a 2099].
      Para otros márgenes de años, habría que aplicar el algoritmo genérico
      teniendo en cuenta los años múltiplos de 100 o 400.
  - NOTAS: Detalle curioso. Para siglos anteriores al XX, habría que tener en
      cuenta que en España y otros países catolicos el mes de octubre de 1582
      sólo tuvo 20 días. Ese mes, el día siguiente al jueves 4 fue viernes 15.
      En el resto del mundo, el cambio fue produciendose en los siguientes
      siglos (hasta el XX). Por ejemplo, en Inglaterra y colonias fue en 1752
      (el día siguiente al 03/09/1752 fue 14/091782). Este cambio introdujo
      las reglas actuales para los años multiplos de 100 y 400.
  - Entrada: Ninguna.
  - Salida:
      > Devuelve 1 si el año es bisiesto, y 0 si no lo es.
*****************************************************************************/
bool bisiesto(void)
{
    // Devuelve 0 si (DS1307_timeAno%4)!=0, y 1 si (DS1307_timeAno%4)==0
    uint8_t dato = DS1307_Ano;

    while(dato >= 4)
    {
        dato -= 4;
    }
    if(dato == 0)
        return true;
    else
        return false;
    //return !(DS1307_Ano%4);
}

/****************************************************************************
  - Función: diasDelMes
  - Descripción: Devuelve el número de días de cualquier mes del año actual.
  - Entrada: Ninguna.
  - Salida:
      > Número en días del mes.
*****************************************************************************/
uint8_t diasDelMes(void)
{
    if(DS1307_Mes==2)             // Mes = febrero
    {
        if(bisiesto())
            return 29;
        else
            return 28;           // Bisiesto: 29 días / No bisiesto: 28 días.
    }
    else
    {
        if((DS1307_Mes==4) || (DS1307_Mes==6) || (DS1307_Mes==9) || (DS1307_Mes==11))
            return 30;            // Meses de 30 días.
        else
            return 31;            // Meses de 31 días.
    }
}

/****************************************************************************
  - Función: LCDPrintNumero
  - Descripción: Imprime en la pantalla LCD un número de 2 dígitos.
  - Entrada:
      > numero: Número entre 0 y 99 a imprimir.
  - Salida: Ninguna.
*****************************************************************************/
void LCDPrintNumero(uint8_t numero)
{
    numero = decimalToBCD(numero);
    LCD_putChar((numero>>4) + 48);       // Imprime dígito decena.
    LCD_putChar((numero & 0x0F) + 48);   // Imprime dígito unidad.
}

/****************************************************************************
  - Función: timeShow
  - Descripción: Muestra en el display LCD la fecha y hora.
  - Entrada: Ninguna.
  - Salida: Ninguna.
*****************************************************************************/
void timeShow(void)
{
    LCD_gotoXY(1,0);
    LCDPrintNumero(DS1307_Dia);
    LCD_putChar('/');
    LCDPrintNumero(DS1307_Mes);
    LCD_putChar('/');
    LCDPrintNumero(DS1307_Ano);
    LCD_putChar(' ');
    LCD_putChar(' ');
    LCD_putChar(' ');
    LCDPrintDiaSemana();
    LCD_gotoXY(1,1);
    LCDPrintNumero(DS1307_Hora);
    LCD_putChar(':');
    LCDPrintNumero(DS1307_Minuto);
    LCD_putChar(':');
    LCDPrintNumero(DS1307_Segundo);
}

/****************************************************************************
  - Función: cicloTimeSet
  - Descripción: Subfunción de la función timeRead() que edita las variables
    del día y hora del reloj.
  - Entrada:
      > limInf : Límite Inferior de la variable editada.
      > limSup : Límite Superior de la variable editada.
      > lcdX   : Posición X del display en la que se muestra la variable.
      > lcdY   : Posición Y (fila) del display en la que se muestra la variable.
      > dato   : Dato editado.
  - Salida: El valor editado.
*****************************************************************************/
uint8_t cicloTimeSet(uint8_t limInf, uint8_t limSup, uint8_t lcdX, uint8_t lcdY, uint8_t editDato)
{
    while((P_INC && P_DEC)==LOW_ST)  // Si se pulsa INC o DEC.
    {
        LCD_command(LCD_CURSOR_OFF);
        if(P_INC==LOW_ST)            // Se ha pulsado INC.
        {
            editDato++;
            if(editDato>limSup) editDato=limInf;  // Controla que no se supere el límite superior.
        }
        else                    // Se ha pulsado DEC.
        {
            editDato--;
            if((editDato<limInf)||(editDato==0xFF)) editDato=limSup; // Si limInf==0 (*Dato)-- puede ser 0xFF.

